// Задача 10: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа. Через строку решать нельзя.

// 456 -> 5
// 782 -> 8
// 918 -> 1

//Console.WriteLine("Введите трехзначное число");
//int num = Convert.ToInt32(Console.ReadLine());
//while (num > 99)
    //num = num / 10;

//Console.WriteLine(num % 10); 


// Задача 13: Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.Через строку решать нельзя.

// 645 -> 5

// 78 -> третьей цифры нет

// 32679 -> 6

//Console.WriteLine("Введите число");
//int num = Convert.ToInt32(Console.ReadLine());
//if(num > 99)
//{ 
    //while (num < 100)
    //    num = num / 10;
    //num = num % 10; 
    //Console.WriteLine("Третья цифра:");   
    //Console.WriteLine(num);   
//}     
//else 
    //Console.WriteLine("Tретьей цифры нет");
    




// Задача 15: Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.

// 6 -> да
// 7 -> да
// 1 -> нет

//Console.WriteLine("Напишите порядковый номер дня недели от 1 до 7");
//int num = Convert.ToInt32(Console.ReadLine());
//if(num == 1 || num == 2 || num == 3 || num == 4 || num == 5 )
    //Console.WriteLine("Нет, это не выходной день");
//else 
   // Console.WriteLine("Да, это выходной день");        
